/*
Задача: Написать калькулятор
Пользователь вводит простое выражение из двух чисел и оператора через пробел, то есть "10 - 100"
Вывести результат с новой строки по образцу:
10 - 100 = -90

Написать для базовых операций: + - / * %
Также вывести слово ошибка, если пользователь некорректно ввёл символ. Советую использовать int

_________________________
*(доп задание, кто разобрался) Также учтите результат выражений:
Ввод: 1 / 0
Вывод: Ошибка, деление на 0

Ввод: 1 % 0
Вывод: Ошибка, деление на 0
_________________________


Ещё примеры
Ввод: 5 / 7
Вывод: 5 / 7 = 0

Ввод: 6 * 10
Вывод: 6 * 10 = 60

Ввод: 5 & 7
Вывод: Ошибка ввода
*/


#include <iostream>

using namespace std;

int main() {
  int a, b;
  char op;
  cin >> a >> op >> b;

  if (op == '+') {
    cout << a << " " << op << " " << b << " = " << a + b;
  }
  else if (op == '-') {
    cout << a << " " << op << " " << b << " = " << a - b;
  }
  else if (op == '*') {
    cout << a << " " << op << " " << b << " = " << a * b;
  }
  else if (op == '/') {
    if (b == 0) {
      cout << "Ошибка, деление на 0!";
    }
    else {
      cout <<a<< " " <<op<< " " <<b<< " = " <<a / b; 
    }
  }
  else if (op == '%') {
    if (b == 0) {
      cout << "Ошибка, деление на 0!";
    }
    else {
      cout <<a<< " " <<op<< " " <<b<< " = " <<a % b; 
    }
  }
  else {
    cout << "Ошибка ввода!";
  }
}

